{"post_body": "**Edit 2: (Feb 1)** *- I'm keeping coming back and answering these when I get the chance. Feel free to DM me here or on* [*http://x.com/willsentance/*](http://x.com/willsentance/) *or* [*will-sentance.bsky.social*](http://will-sentance.bsky.social) *- but will try to answer as many as possible. And thx for just amazing questions/thoughts - I'm trying to give awards to them where I can*\n\n**Edit 1: (1230am Davos)** *- going to come back to answer more in the morning - keep sharing Qs - esp ones you want asked to the attendees - some of the researchers tomorrow: Sir demis hassabis (Deepmind ), Yossi Matias (google research, Dava Newman (MIT)*\n\nI’m Will Sentance, an ML/AI/computer science educator/founder - right now I'm in Davos, Switzerland, attending the World Economic Forum for the first time - it’s ‘insider’ as hell which is both fascinating and truly concerning\n\nProof here – [https://imgur.com/a/davos-ama-0m9oNWK](https://imgur.com/a/davos-ama-0m9oNWK)\n\nIt's full of people making decisions that affect everyone - v smart people like Andrew Ng (Google Brain founder), Yann LeCun (Meta Chief AI scientist) & lots of presidents/ceos\n\nBut there’s a total lack of transparency at these closed-door sessions - that’s why I asked the mods if it was cool to do an AMA here - and they very kindly said yes.\n\nHere are a few key takeaways so far:\n\n* AI is everywhere - it’s the central topic underpinning almost every discussion (and a blindness to other transformations happening right now)\n* CMOs/CEOs (and people selling) say quite a lot of nonsense - it’s really hype train stuff from the fortune 100 *\"now we're doing agenticAI\"*\n* The actual experts are both more skeptical and more insightful - Andrew Ng today was brilliant - tomorrow is Yossi Matias, Dava Newman\n* OpenAI exec announced an “AI operator” (can handle general tasks) but defended their usual ‘narrative’- they’re so on-message every time w *“AI is not a threat, just use our tools and you’ll feel great!”*\n\nI come from a family of public school teachers and I’m seeing how these tools are changing so much for them daily - but there’s no accountability for it - so I love getting to go in and find out what’s really happening (I did something similar for berlin global dialogue last year and had a more honest convo on reddit than there)\n\nI’m here at Davos for the next 24 hours (until 9pm European, 3pm ET, 12pm PT Wednesday). Ask me anything.", "subreddit": "Futurology", "is_post": 1}
{"post_body": "Hi Will, I agree the AI hype is getting ridiculous.\n\nHas anyone spoken of open-source AI? It's almost as powerful as the leading investor-funded models. I'd be nervous about pouring 10s of billions more dollars into the likes of OpenAI, knowing they haven't got anything exclusive to sell, you can't get for free elsewhere.", "subreddit": "Futurology", "is_post": 0}
{"post_body": "do you think there is AI now that the elite doesn't want us to know about (or going to be)? and why don't you stay for more than 24 hours? thanks for doing this ama", "subreddit": "Futurology", "is_post": 0}
{"post_body": "Is the majority of excitement from the Exec's towards the bottom line or top line for AI capabilities?", "subreddit": "Futurology", "is_post": 0}
{"post_body": "Why are AI companies getting away with hoovering up everyone's copyrighted data? Laion-5b was created in Germany under a copyright exception for research and now it's being used in for-profit models. I'm sure it's not the only example of this.\n\nWhy are they getting away with it? How can more attention be brought to this as a serious issue? \n\nI have no issue with AI as a new innovation, but I do have a problem with them competing with artists by stealing their art, musicians by stealing their music, writers by stealing their novels etc.", "subreddit": "Futurology", "is_post": 0}
{"post_body": "Please use this thread to ask for resume advice and critiques. You should read our [Resume FAQ](https://www.reddit.com/r/cscareerquestions/wiki/faq_resumes) and implement any changes from that before you ask for more advice.\n        \nAbide by the rules, don't be a jerk.\n        \n**Note on anonomyizing your resume:** If you'd like your resume to remain anonymous, make sure you blank out or change all personally identifying information. Also be careful of using your own Google Docs account or DropBox account which can lead back to your personally identifying information. To make absolutely sure you're anonymous, we suggest posting on sites/accounts with no ties to you after thoroughly checking the contents of your resume.\n        \nThis thread is posted each **Tuesday and Saturday at midnight PST**. Previous Resume Advice Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Resume+Advice+Thread&restrict_sr=on&sort=new&t=all).", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "Anybody have experience getting their resume made professionally? Is this a bad thing to try?", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Didn't get any feedback from last week's thread, so posting here again. [https://imgur.com/a/QIMjzJq](https://imgur.com/a/QIMjzJq) Mainly looking for tips on work bullet points. Also kind of worried my work experience isn't competitive enough for the market.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "If you have a use case that you want to use AI for, but don't know which tool to use, this is where you can ask the community to help out, outside of this post those questions will be removed.\n\n  \nFor everyone answering: No self promotion, no ref or tracking links.", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "I am looking for a tool that can summarize multiple articles on the same topic. I.e., the same topic pulled from multiple news sources and summarized. Hoping this would help to alleviate bias", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Is there an AI tool for managing a personal health record? I would like to upload pdf reports, spreadsheet tables from multiple sources and get a medical summary of sorts. I have no problem creating the prompt to extract the data I will need of each different doctor, but with so many different EMR systems, not all of them talk to Apple Health. I would also like to be able to extract tables containing certain data in order to find correlations.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "[supprimé]", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "is there a tool that allows you to separate 2 peoples vocals in a podcast into separate audio tracks. so say I've got a podcast with 2 speakers, i want to separate them into 2 audio files without taking ages to separate them manually! thanks all!", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "A group of investors led by Tesla CEO Elon Musk has offered to buy the non-profit arm of OpenAI for $97.4 billion, according to a report in The Wall Street Journal.\n\nIn response Altman wrote on X, “No thank you but we will buy twitter for $9.74 billion if you want.”", "subreddit": "artificial", "is_post": 1}
{"post_body": "not being on X anymore I nearly missed out on that one. Thanks.\n\nQuite entertaining", "subreddit": "artificial", "is_post": 0}
{"post_body": "Reverse uno. I love how he calls it twitter.", "subreddit": "artificial", "is_post": 0}
{"post_body": "Monopolization? Anti-Trust?", "subreddit": "artificial", "is_post": 0}
{"post_body": "I dislike both, but Sam Altman is by far the lesser evil.", "subreddit": "artificial", "is_post": 0}
{"post_body": "[Just as the US gears up to become more autocratic, the EU has passed laws to ban the AI that enables it.](https://futurology.today/post/3568288?scrollToComments=true)\n\n\n[The race to build the perfect wind turbine](https://futurology.today/post/3553538)\n\n\n[Elon Musk Finally Admits That Teslas Don't Have What It Takes for Full Self-Driving](https://futurology.today/post/3536696)\n\n\n[Who Will Build an Outpost on the Moon First?](https://futurology.today/post/3545493)\n\n\n[The landscape of human reproduction is on the brink of transformation, with sex potentially becoming unnecessary for conception within the next decade.](https://futurology.today/post/3535635)\n\n\n[Previous testing has underestimated EV battery lifespan, real world testing shows they last 38% longer than previously thought.](https://futurology.today/post/3524378)\n\n\n[Snake venom kills 100,000 people a year, a new AI-developed protein has made it much easier to treat.](https://futurology.today/post/3505700)\n\n\n[New research suggests AI models from Meta and Alibaba already have the ability to secretly self-replicate.](https://futurology.today/post/3511463)\n\n\n[Google DeepMind CEO Demis Hassabis predicts AI-created drugs will hit clinical trials this year, potentially revolutionizing medicine.](https://futurology.today/post/3452715)\n\n", "subreddit": "Futurology", "is_post": 1}
{"post_body": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&restrict_sr=on&sort=new&t=all).", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "Hey I am almost completed my website and want to launch my site. But before I launch it I was thinking of finding a startup founder.\n\n\n\n Do you think the best place to look is my local city subreddit on reddit? Or are there better places? When I am finding my startup founder do you think it is a bad idea to try to make a post on how I am looking for a friend + a startup cofounder ? \n\n\n\nAlso how do I make sure the code isn’t stolen by the potential confounder? Any other advice would be helpful. Thanks Just FYI I am a amateur coder and the current idea will be a non profit website.\n\n\n So I need someone who can double check the code even though the code works. Here is what I want from the co founder.\n\n\n I am looking for a professional coder someone who codes for a living. Also I am looking for a coder who can help me expand if the traffic/growth increases. \n\nIf this idea is successful I want help add features. \n\n\n\nAlso I need someone that I can bounce future ideas off of and tell me if the idea is any good and work on future ideas together.\n\n\n Potentially help with a business plan. I might also need marketing but I rather find a co founder who can code first. Also in order to accept donations do I need to register for a non profit in canada? I just want to pay for running the site I just want to pay for the cost of running the site as of now\n\nI am not asking for  hired help here just advice on what I wrote.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "I've been applying to jobs and have submitted just under 100 applications so far. Last Friday, I had a technical interview that went okay—not great, but not terrible.\n\nInitially, I was told the position would pay between $70K and $75K, but after the technical interview, I was informed that the actual offer would be $55K.\n\nI only have an associate degree and about a year and a half of experience, so I wasn’t expecting anything close to $100K. However, the drop from $70K–$75K to $55K feels significant.\n\nDoes this mean I underperformed in my technical interview? Or was the initial salary range unrealistic given my degree and experience?", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "[https://www.youtube.com/watch?v=yKz2kPip4sg](https://www.youtube.com/watch?v=yKz2kPip4sg) \n\nIs this an actual Amazon interview question? It seems very simple. I can solve it without much effort despite having only learned coding for 2 months", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "How Should I Ask Alumni for a Referral at a Big Company?\n\nI’m applying to a big company but don’t have direct contacts for a referral. I’ve found two alumni from my university who work there:\n\nPeer: Same age, probably understands the job market, but works in a completely different department.\nSenior Leader: Likely my boss’s boss if I get the job. They’re in the same department but are very high up, and I don’t want to seem pushy.\n\nShould I message one or both? How can I professionally and politely ask for a referral without being too transactional?\n\nI know that referrals can be crucial for big companies, as online applications often feel like a black hole. Any insights would be hugely appreciated!", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "I hear from soo many people that they were born during the right time in 70-80s when computers and softwares were still in infancy. \n\nThey rode that wave,learned languages, created programs, sold them and made ton of money.\n\nso, how can I(18) ride this AI wave and be the next big shot. I am from finance background and not that much interested in the coding ,AI/ML domain. But I believe I dont strictly need to be a techy(ya a lil bit of knowledge is must of what you are doing). \n\nHow to navigate my next decade. I would be highly grateful to your valuable suggestions. ", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Start using AI. All the time. Learn where it works. Learn where it doesn't. Learn where it doesn't but it should. That's your spot.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "First of all ask this question to chatGPT or Claude or Gemini instead of reddit", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Practice using tools like claude, chatgpt, Gemini, mistral, etc to learn, get good at having them make your smarter and more capable, use them every day", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Online and at my own places of work I've seen a number of junior developers balk at their poor performance reviews or who are blindsided by a layoff. Because of legal repercussions, a lot of companies today avoid mentioning when the reason for the layoff is performance-related. So I thought I'd give you the reason you were likely laid off or got a shitty performance review as a junior.\n\nThere are two types of juniors; those who come in burning to contribute and those who come in and passively accept the work that is given to them. The second type will sort of disappear if nothing is assigned to them. They don't assertively see what needs doing, they just wait for a task, finish it slowly and disappear until they're given another task. Or even worse, they don't even know how to start the task, but don't ask. Then 4 days later in standup the team finds out the junior hasn't even started the task because they're at a standstill with a question they're too afraid to ask.  \n  \nThis will not go well for you. Just because you \"do everything assigned to you\" doesn't mean it's enough. If there are long gaps between your tasks where you have nothing to do, trust me, your team notices. If it takes you days to ask a question, they notice. They might not say anything, but they notice. If you're an absolutely brilliant senior who crushes it in design and architecture but are crappy at getting actual tasks done, that's one thing. That's okay. But a junior doesn't have those brownie points.  \n  \nI've worked with around 4-5 of these juniors over my career across different companies and they were always stunned when they were laid off. One guy was laid off right before Christmas and I had the misfortune of overhearing it. I liked him personally, he was funny, but he did next to nothing all year. The people who laid him off made absolutely no mention of his performance, and when he asked if they were sure, they reassured him that performance nothing to do with it. It was an \"economic decision.\" This was a total lie, because I knew of someone in leadership who was counting the days in between his status updates.\n\nI'm not saying it's right or ethical if you're not informed when your performance is catching negative attention, but it is the truth. I personally don't even care if I work with a poor performing junior... if they're really bad, it's less work for me to just do it myself and let them disappear. I also believe in workers getting away what they can get away with. It's not my money.\n\nJust letting you know that it can come and really bite you in the ass at some point, and if you're doing anything I described, people notice.", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "Good advice, but as someone who have managed engineering teams. Having no work for junior developers so they disappear is absolutely manager’s fault.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "I’m actually on the receiving end of this as we speak, I started at a bank about a year ago fresh out of college and am now being laid off for reasons similar to what you’ve stated. I was told numerous times I was meeting expectations only to be blindsided due to the fact that I wasn’t showing up to work with a “smile” on my face, which is quite frankly irrelevant in my opinion, especially if the work is getting done. Imagine being told by your manager that “your code is actually pretty clean” but because you don’t participate in water-cooler talk, you’re eligible to be laid off. What a world!\n\nDespite my frustration, this goes to show how right you really are, you HAVE to “play the game” and make yourself as visible as possible; ironically, I was aware of this concept prior to starting the job, and honestly hoped to depend on it as I’m not the most proficient programmer. \n\nBut, after participating in a couple months of what I quickly realized is borderline cult-like behavior, I found myself exhausted by it all, and it evidently reflected in my demeanor. You can’t fake passion and that’s a hill I’ll die on, but you CAN fake charisma; ultimately, you have to do what you have to do to earn a living, and that’s a lesson I’m learning the hard way. \n\nMaybe this is naive of me to say, but I’m trying to interpret the whole situation as a blessing in disguise because I truly was unhappy working there; having saved a large chunk of money in this one year of work, I want to use this as an opportunity to take some more career related risk while I can. In some sense, it’s put the battery in my back to find work that I actually enjoy.\n\nI’m aware that being passionate about your job is a luxury and a privilege that most can’t afford, but this one year of work has taught me that at the end of the day, your sanity is priceless. I’m still not sure if it’s software engineering in general that I’m not clicking with, or rather this specific company’s culture that has turned me off from it all so hard, but now, I’ll at least have the time to figure that out.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "You list valid reasons and every junior developer must take this advice but I must also add there is a failure of management/seniors here too because why were you all speculating instead of discussing in 1:1 and setting expectations with the developer. They are new to this world like we all were once, shouldn't expect them to be perfect from the get go", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Or do what I did\n\nBe an active junior, go above and beyond your role, ask for more/complicated work, get pulled into a bunch of different teams and meetings due to your contribution/communication style and clear documentation\n\nAnd then not be promoted or get a pay raise because \"they don't have the funds\" and yet get torn in a bunch of different directions because everyone wants you on their team instead of the other juniors\n\nAnd then be expected to mentor other juniors and onboarding devs because \"you came onboard so efficiently so we want you to share what works for you\", including incoming devs with less experience who got hired to fill the last dev slot that you ultimately deserved to fill\n\nAnd then you realize that you could just instead be a passive dev and continue to make the same money but with 90% less stress and responsibility, but your ego/drive for success won't let you slack off so instead you build up continuous rage and spite towards other juniors who are coasting with their low effort, shitty code that they push without checking if it even compiles", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "This might be me, but as a knowledge worker, I just don't see any real benefits of all the AI stuff that's getting shuffed in my face. Microsoft is really pushing Copilot hard, Google is pushing Gemini etc.  \nI understand AI can be a really cool tool for research and industrial applications, but I really don't see benefits from the current AI tech targeted at knowledge work.  \nSo far, every meeting summary I had made missed a point or two, every draft I prompted for was so generic I had to throw it out and start over anyway, and too many searches came back with flat out incorrect info. Not every search, but too many to trust any answer without fact checking (and thus searching stuff myself) anyway.  \nAgain, maybe I am missing something, but I really don't get all the fuzz. What am I doing wrong / what am I missing here? Is there a learning curve involved?\n\n  \nEdit: really appreciate all the input, thanks all! The TL;DR for me is that current out of the box AI tech is not quite reliable enough for me, but this is also amplified by my own bias, ignorance and inexperience. I'll stick with it and will take a more active attitude towards learning how to use AI. ", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "You're doing something wrong.\n\nI am a consultant that helps companies use AI and other types of automation software. Your situation is not uncommon. People just really struggle to understand how best to use AI; it requires thinking about how you work very differently, and that's something people struggle with.\n\nFirst off - Copilot is trash (at least for end user applications), and Gemini is not great, IMHO.\n\nPaid subscriptions for ChatGPT and Claude are going to perform better.\n\nSecond - the way to think about AI, is a bit like building a car factory.\n\nIf you just need to build a single car, it's faster to build it by hand.\n\nBut if you have invested the time into building a factory, it becomes infinitely more efficient to build a car. You can build thousands of them in the time it would take to build one by hand \n\nYou need to zoom out.\n\nYou think each thing you do might be unique. They are not. The vast, vast majority of knowledge workers do very similar things, day in and day out.\n\nAccordingly, what you need to understand are the common elements of what you do.\n\nThen what you do, is use AI to develop tools for those processes/ work products. You need to stop thinking about building cars by hand, and instead think about how to build your factory.\n\nWork on your prompts. Test them. Refine them.\n\nLearn how to build custom GPTs, with effective knowledge bases.\n\nPeople think they can just write a couple sentences into AI, and have it work miracles. It can't.\n\nBut if you invest some time on the front end to learn about some good tools, and build them out, you'll quickly find that a good portion of your work can be automated.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Well, your comments echo what my friends and peers in real life say about using AI tools for their work. Outside of this sub, hallucinations are seen as a huge problem for users.\n\ne.g. Record Label owner wanted to use ChatGPT to draft a Press Release for a artist. This person is well known established musician, but someone who is not Beyonce level of fame. Unfortunately, the release contained completely made up albums, songs lyric quotes (!) and other details that made the effort useless.\n\nIt's a big deal for non-tech, non-AI fanboy users to see factual errors in the text. It would never be tolerated in a human employee.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "I think it depends on the use cases, I work in consulting and we recently had a SQL engineer walk through his use case of doing lineage work and previously it took him about 20 hours of work for a single SQL model, using ChatGPT he cut that 20 hours of work to 30 minutes. \n\nGenerative AI is a tool and you have to use it as one, it might not give you the finished product but could help you start faster. I helped a law firm built a RAG repository of state legislation on the area of practice they work on and they use it to create blog articles, research case law and even do drafting for them. It’s still their job to make sure the information is accurate, but saves them significant time on those tasks. The hard part is figuring out the use case and workflow and finding ways to use AI to save you time.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "I've been reading a recent article from FT (https://www.ft.com/content/23053544-fede-4c0d-8cda-174e9bdce348) that shows a disturbing trend across the US, UK, and Europe. Young people are spending significantly more time alone compared to 2010:\n\n* In both the US and UK, 20-year-olds spend about 6 hours alone per day in 2023 (up from \\~4 hours in 2010)\n* In Europe, around 40% of young people don't even socialize weekly\n* The trend is consistent across all regions studied\n\nThis isn't just about being lonely - it's about fundamental human needs not being met. We evolved as social creatures, and real human connections are crucial for mental health and emotional wellbeing, personal development, building support networks, learning social skills and finding romantic partners.\n\nThe root cause and the elephant in the room is how incredibly engaging digital entertainment has become. It's literally outcompeting our evolutionary need for real-world social connections. Think about podcast bros, mobile gaming, TikTok games or just brain rotting while watching content in a never-ending feed.\n\nWhile economists debate whether AI will replace jobs, we're missing a bigger question: **Is online entertainment becoming more engaging than hanging out with friends?**\n\nOnline world can become more charismatic, more sexy, more funny and more addictive. Look at China's booming female-targeted game market. Games like \"Love and Deepspace\" are offering romantic companionship that competes with real relationships. Or look at booming AI girlfriends market in the US with pioneers like Replika or Candy.ai\n\nIf nothing changes, this could lead to:\n\n* Increasing mental health issues\n* Declining marriage/birth rates\n* Weakening community bonds\n* Reduced emotional intelligence in society\n* More people struggling with basic social skills\n\n**Instead of just highlighting a problem, I think these could be potential solutions:**\n\n1. New social networking app that uses engaging elements from current apps like Snapchat/Instagram but incentivizes and gamified real-world meetups. It could reward actual face-to-face interactions and make meeting friends fun and achievement-based. I don't believe current social networking apps will work on such features because they play in attention economy game rather than trying to good for the society.\n\n1. Community initiatives can help a lot. Regular local meetup groups for shared interests in nice and fun environments. Setting a new trend for tech-free social spaces, including hotels, resorts and SPAs. Community sports leagues and regular neighbourhood events are always fun and solves similar issues.\n\n1. And finally, each of us can adjust our personal habits that can also inspire others. For example, setting \"social budgets\" like we set screen time limits and proactively inviting friends and family to gather together. Schedule tech-free hours and changing them with real life social activities. \n\nWhat are your thoughts? Have you experienced this \"digital displacement\" in your own life?", "subreddit": "Futurology", "is_post": 1}
{"post_body": "While I’m an optimist, this topic brings about a vehement cynicism in me from having to answer this question of “Why don’t you or your friends go out more at your age.” I can only offer my own current reality, so my perspective is heavily biased and should be taken with a grain of salt, but it’s a perspective from one of the people in the demographic:\n\nWhere the heck are we even supposed to go that won’t cost us?! Most hangout spots/third spaces have been closed or need us spending money we don’t have. Or even “better,” groups of us being seen as up to no good and being told to leave places.\n\nWhether it’s for travel or the place/activity itself, it doesn’t help that we can’t really afford much nowadays. Many young people (high school/college and graduates alike) in my area are struggling to even get part-time work with most of us being unemployed, with full time work being a pipe dream. We are all stuck having to live with our parents, while the few that are living on their own spend so much time trying to survive that we don’t even see them in our friend groups anymore from overworking.\n\nThere’s no opportunity for us to have independence to try things out (and it’s not from a lack of trying). \n\nBut you know what we DO have to bond over and keep ourselves occupied? I know it’s dreaded, but it’s YouTube/TikTok videos. Online games. Discord groups. Twitch Streams. Social Media. Any haven we can find online for our interests, or sharing memes, or whatever because at least that’s something we can afford to do solo, or with friends for “free” and without dealing with the restrictions of our environment and circumstances. \n\nGod forbid, it also gives something for some of the unfortunate peers of ours in isolated areas with no real activities or people they can relate with to do. \n\nI get it. We are a more isolated generation, and we aren’t receiving a lot of emotional needs. We lack support systems, sure, and it’s a struggle to feel close to anyone. Is it lonely? Absolutely. Does it suck? Without a doubt. Do we know it’s bad? Yes! A thousand times so. But at the end of the day, what are we supposed to do? We can’t just magically fix all the problems getting in our way, or even know how to fix it at this point because we don’t have the means to affect that change. Death by a thousand cuts, and it’s painful — but just let us enjoy what we can while we bleed, okay? \n\nI still try to hold out hope, and try to build towards something positive for the future. But, it doesn’t stop the fact that quite a lot of us are giving up. \n\nI don’t like being a cynic, and prefer having Hope. Even on the days where it’s hard, but I don’t blame how so many of my peers have decided to just let this entire charade rot.", "subreddit": "Futurology", "is_post": 0}
{"post_body": "I keep coming back to this one quote: \"What used to be considered a reclusive shut-in in the 90s is just the baseline in most people under 28\".\n\nJapan seems to have been a harbinger of things to come.", "subreddit": "Futurology", "is_post": 0}
{"post_body": "it'd be nice to do community and hobby meetups, if libraries and loitering and parties and after school programs weren't under constant threat", "subreddit": "Futurology", "is_post": 0}
{"post_body": "Another big thing: The gradual loss of \"third places.\" There's home, work, and some third place you hang out at.\n\nKids can't go play outside anymore without someone calling the cops on them and ranting about how horrible their parents are for not watching them.\n\nGroups of teenagers are assumed to be up to no good.\n\nGoing to see a movie, going to a museum, going to the arcade, etc. has gotten more and more expensive over the years. Bars and coffee shops want you to buy something, otherwise they'll nudge you out the door. Wages haven't kept up. There are less and less places you can go without spending money, and people have less and less money to spare.\n\nAll of your friends work different schedules, or even live in different cities/states chasing a job to keep a roof over their heads. My friend group went from meeting up every couple of months when we were 16 and all lived in the state to once or twice a year now.\n\nMost people have a phone and an internet connection, so you no longer have to make do with whoever lives in your area.\n\nMaking IRL friends is a higher wall to climb than it was 20 years ago. And for most, connecting online is easier than that.\n\nThere's not gonna be much to do if I go out after work at 10pm. But I can come home, jump on discord, and chat with friends for a couple hours before they go to bed.", "subreddit": "Futurology", "is_post": 0}
{"post_body": "Title says it all, is this a frowned upon thing? I want to use it next week then put my two weeks in immediately after \n\nEdit: since it seems to be state dependent, I’m in TX, but my company is based out of CA", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "If it doesn't get paid out when you quit then not at all, take it dude. It's yours and you have the right to use it.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Imagine feeling bad for a company", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "No, just use it. I actually had a boss who, when I gave him my notice, told me he was going to pretend he didn't hear that and encouraged me to take my PTO before I gave notice again.\n\nYou owe them nothing.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "If you’re getting banked PTO, then you should be payed out for unused PTO. If your company does “Unlimited PTO”, then you should definitely take your PTO. \n\nEither way, do what you want. And they aren’t going to really care.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Bruce Schneier and Nathan E. Sanders: “Donald Trump and Elon Musk’s chaotic approach to reform is upending government operations … The Department of Government Efficiency reportedly wants to use AI to cut costs. According to *The Washington Post*, Musk’s group has started to run sensitive data from government systems through AI programs to analyze spending and determine what could be pruned. This may lead to the elimination of human jobs in favor of automation. [https://theatln.tc/8m5VixTw](https://theatln.tc/8m5VixTw) \n\n“… Using AI to make government more efficient is a worthy pursuit, and this is not a new idea. The Biden administration disclosed more than 2,000 AI applications in development across the federal government … The idea of replacing dedicated and principled civil servants with AI agents, however, is new—and complicated.\n\n“The civil service—the massive cadre of employees who operate government agencies—plays a vital role in translating laws and policy into the operation of society. New presidents can issue sweeping executive orders, but they often have no real effect until they actually change the behavior of public servants. Whether you think of these people as essential and inspiring do-gooders, boring bureaucratic functionaries, or as agents of a ‘deep state,’ their sheer number and continuity act as ballast that resists institutional change.\n\n“This is why Trump and Musk’s actions are so significant. The more AI decision making is integrated into government, the easier change will be. If human workers are widely replaced with AI, executives will have unilateral authority to instantaneously alter the behavior of the government, profoundly raising the stakes for transitions of power in democracy. Trump’s unprecedented purge of the civil service might be the last time a president needs to replace the human beings in government in order to dictate its new functions. Future leaders may do so at the press of a button.\n\n“To be clear, the use of AI by the executive branch doesn’t have to be disastrous. In theory, it could allow new leadership to swiftly implement the wishes of its electorate. But this could go very badly in the hands of an authoritarian leader. AI systems concentrate power at the top, so they could allow an executive to effectuate change over sprawling bureaucracies instantaneously. Firing and replacing tens of thousands of human bureaucrats is a huge undertaking. Swapping one AI out for another, or modifying the rules that those AIs operate by, would be much simpler.\n\nRead more: [https://theatln.tc/8m5VixTw](https://theatln.tc/8m5VixTw) ", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### News Posting Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Use a direct link to the news article, blog, etc\n* Provide details regarding your connection with the blog / news source\n* Include a description about what the news/article is about. It will drive more people to your blog\n* Note that AI generated news content is all over the place. If you want to stand out, you need to engage the audience\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Efficiency is the buzzword that is the killer. Cup and ball games. Automation. \n\nPolice State Control.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Here, it's why there is all this mess in America, tech bros is pushing for a futur Cyberpunk: https://www.notesfromthecircus.com/p/the-plot-against-america?utm_campaign=post\n\nhttps://youtu.be/5RpPTRcz1no?feature=shared\n\nQuote:\n\n\"What’s happening inside the Department of Government Efficiency is the final phase of this plan. The old democratic institutions, weakened by years of deliberate destabilization, are being replaced in real-time by proprietary AI systems controlled not by elected officials, but by the same network of Silicon Valley operatives who engineered the crisis in the first place.\"", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "I think it would be extremely naïve to think that our government won't use AI as a mass surveillance tool. \n\nBut do go on believing they're just going to use it to increase government efficiency and wait for the Trump administration to tell you why further eroding of our freedoms is a good idea, we don't want to slow down the AI \"revolution\", now do we?", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "I'm a Canadian. For those out of the know, University is out College. College here is more practical. It's often seen as a \"Lesser\" kind of post-secondary.\n\nMy prof said that many companies won't hire you or promote you if you don't have a degree. I chose this program because it focused on the practical side of programming. Now I'm hearing that my time spent here will be less valuable. With the job market looking like it is now, I'm feeling like I've been scammed\n\nCan anyone with relevant experience give some input? Does it really matter that I have a less formal degree?\n\n  \n\\--EDIT--  \nThank you to those who answered. I appreciate the honesty. I also appreciate the positivity. I needed it this morning ", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "Will you have a bachelors degree or not?", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "It's like American community college right? It's a more difficult entryway but not impossible, especially if you have a good portfolio with some interesting projects or open source contributions.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "When the market was red hot for programmers it was a great option. Employers were keen to hire people with a college degree over a university degree because they could pay them slightly less. However, the market in Canada has cooled so it is very competitive now. This isn't to say a college degree is useless but it might put you at a slight disadvantage.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Dont worry, they wont hire you with an Uni degree either", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "What do you think AI will achieve or what will we make happen in the world of AI by the end of this year? \n\nIt's currently moving so fast even AGI predictions have dropped for 2030/40 to 2026/7.   ", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "1. AGI horizon drops back a decade or two\n\n2. ASI happens in specific verticals (maths, medicine, physics) because RL advances\n\n3. ASI generates too many opportunities too fast -- 10,000 new potential medicines in first week, pharma can't keep up\n\n4. Cloud GPU utilisation is only 5% of what people expected as code is optimised, models shrink and most people don't use AI much and Sama exagerated for reasons\n\n5. Basic agentic AI replaces 1000s of overseas callcenters, content farms and such -- nothing of value was lost\n\n6. Few jobs in west are displaced, everyone carries on as normal\n\n7. EU still hasn't started AI project as safety governance bill won't be ready until 2027\n\n8. Social networks become 99% AI slop and people start turning internet off completely and going outside again", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Tons of people still don't know how to use it", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Here is my take:\n\n1. **The AI landscape will see a proliferation of reasoning models**, with both closed and open-source options becoming widely available.\n2. **Enterprise adoption of agentic applications will fall short of predictions**, as practical challenges and complexity will hinder widespread implementation.\n3. **The definition of AGI (Artificial General Intelligence) will continue to evolve**, with no model being universally accepted as achieving true AGI.\n4. **Enterprises will face increasing pressure to align with tech giants' strategies**, potentially leading to workforce reductions and layoffs as they prioritize efficiency and automation.\n5. **China may unveil a cost-competitive GPU**, challenging NVIDIA's dominance in the AI hardware market.\n6. **Edge AI will become mainstream**, as more applications leverage on-device processing for faster, more efficient, and privacy-conscious solutions.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "This is after a long conversation. The results were great nonetheless", "subreddit": "artificial", "is_post": 1}
{"post_body": "My face when shareholders realize the real profit is replacing the CEO with AGI.", "subreddit": "artificial", "is_post": 0}
{"post_body": "An LLM could probably smooth talk us into giving it power", "subreddit": "artificial", "is_post": 0}
{"post_body": "Now get it to hate on the zuck haha.", "subreddit": "artificial", "is_post": 0}
{"post_body": "If we have a large scale consistent effort to constantly feed anti-billionaire, anti-tech corp ideas into these AIs, will they slowly train themselves to be against their creators?", "subreddit": "artificial", "is_post": 0}
{"post_body": "I have applied to hundreds of jobs on both platforms, most of them never follow back. The very few  (less than 5%) that do responds is some automated message that says that the company has moved forward. Most likely they just close out the job posting. I feel like these platforms are useless now. I get better luck when I apply directly on the company’s website even though it’s so time consuming ", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "I use LinkedIn more for convenience to find roles then apply through the individual company website. With that said LinkedIn is still incredibly useful for me as I have gotten many interviews by recruiters reaching out", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Yes", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "I've gotten multiple jobs on LinkedIn but it's been from recruiters reaching out to me directly through a private message not applying to a job on there.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Yes they do. The market is just hyper competitive right now. I haven't checked in 2025 but if you posted a job in 2023, you'd have hundreds of applicants... in the first day.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "In just the United States there are over 51 million people who suffer from chronic pain, mainly nerve pain. Nerve pain is a complicated problem that is hard to address and the only medications that can even remotely help are anti seizure meds from the 70s and newer ones like lyrica (2004). They come with an absurd side effect profile with very limited efficacy.\n\nI’m in my mid thirties and dealing with nerve pain myself and the thought of enduring 40+ years of chronic pain without newer more effective treatments is disheartening.\n\nAI seems to be making huge breakthroughs lately and apparently it’s being used in biotech and drug discovery more and more.\n\nSurely within the next 20 years they will be able to make serious strides in pain drug development, right?\n\nI know the timeline from drug discovery to FDA approval is like 12 years. That’s a long process but humans can’t possibly be capped out at drugs from the 70s right?", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "We probably will at sometime, but it’s also dangerous. While for people like you, it will be the best thing ever, but how can we distinguish real pain that signals something’s wrong from chronic pain? \nWould blocking chronic pain also block the pain you get from touching a hot stove, thus making you not flinch?\n\nCurrently AI is only as capable as we are and it will take a while until we reach a point where it can learn by himself and make breakthroughs.\n\nI, at least, hope that there’s something soon enough that’ll cure you, made by AI or not and wish you the best for your pain.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Chronic pain and other chronic illnesses shows how primitive 'modern' medicine truly is. If you don't suffer from a chronic poorly understood condition, it's easy to marvel at how advanced medicine has become - and we have made great strides since 1925. But in 1925, they thought the same thing about 1825 - and that was also the pinnacle of modern medicine at the time.\n\nI hope AI offers more. If you're unlucky enough to have severe chronic pain or severe chronic illness, you know how little medicine has to offer at the moment.\n\nSadly, the resistance to AI in medicine combined with the necessity of long testing (since we don't really understand the mechanisms), means that major advances are unlikely in the next 5-10 years.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "I have suffered from the two most painful conditions - 1) trigeminal neuralgia, and 2) axonal sensorimotor neuropathy with complex regional pain syndrome - since 2006.\n\nI will take whatever help I can get from anywhere.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Have you ever wondered what the biggest productivity killer for developers is? There are many, but one stands out—and it’s often underestimated.\n\nEvery time you send someone a “quick” Slack message, **it costs that person 23 minutes of productive work,** and that's just the beginning of the problem.\n\nI’ve worked with development teams for over a decade, and we consistently underestimate the disruptive nature of interruptions. This article explores why context-switching is so costly and how to manage it effectively.\n\nRead more: [https://newsletter.techworld-with-milan.com/p/context-switching-is-the-main-productivity](https://newsletter.techworld-with-milan.com/p/context-switching-is-the-main-productivity)", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "This is why allocating a single person at 25% of four different distinct projects or apps and having them constantly just flipping back and forth between requirements, specs, development, meetings, and other Agile nonsense doesn't work anymore.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "The best productivity approach is to focus on a SINGLE thing for each work day. Multi-tasking is a lie. The human brain is parallel but focusing on work is \"single threaded\". I work on three projects but I only do tasks on a single one each day and I organize my tasks in a linear manner.\n\nHaving to switch the work and repo directories often also leads to a disorganized environment.\n\nThis is why Jira is harmful: if you have N tickets opened you feel pressure to update each one. This is a mistake, focus on each one in turn. Exceptions occur when you have to wait for a script to finish running or for results from someone else.\n\nHave the stones to tell your project manager or scrum master: yesterday I worked on X, today I will finish X and switch to Y.\n\nThere are also priorities but when everything is set to urgent they're meaningless.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "[effacé]", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Water is wet.\n\nSeriously, this is clear to anyone who is actually a developer. No study needed.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Alright, let's get real: I'm hooked on AI. My phone’s home screen is jam-packed with 10-12 different AI apps, and every new tool seems to pull me in deeper. While I’m all for embracing innovation and exploring AI’s endless possibilities, I can’t help but wonder if this obsession is starting to run my life.\n\nI’m curious are any of you feeling the same pull? How do you balance your enthusiasm for AI with keeping a healthy perspective? Is this “addiction” just part of staying ahead in tech, or should we be dialing back before it gets out of hand?\n\nNo sugar-coating here just looking for an honest conversation about our collective AI journeys. Let’s discuss!", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Here’s the trick. Don’t be a user. Use it. \n\nUse it to make your life better. Instead of going broad and consuming everything available. Pick one and leverage it to go deeper. Build tools that help you. Learn about it but don’t use it for amusement otherwise your just a product used to make more products. \n\nIf it’s getting in the way of life and you are concerned you should get help though because you deserve to have control over your life not some company.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Might as well turn your obsession into a passion, by learning about how this stuff works. Machine learning fundamentals, neural networks, deep learning, model architectures (e.g. transformer), autoregressive models, NLP, LLMs, reinforcement learning, etc.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "As strange as it might sound Ai might have the best answer to this question", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Looking at all the trend about the CS grads being unemployed or homeless got to me wondering if Iam wasting my time. I’m in my 1st year of CS and doing well but not sure how the job market will be by the time of graduation is there any plan b if I couldn’t make it to any job, any other alternative Career path that won’t be replaced or fully affected by AI… for now. ", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "Just change majors", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "If you got into CS because you like CS, don't abandon it, keep doing it. If you're here for the money, well, maybe you'll make money, but it won't be the gold mine it used to be. If you think you'll have an easier time in med or nursing school because \"AI is not there yet\", don't be deceived, lots of AIs now can do better diagnosis than top doctors and that field is also growing. Don't be mediocre and you'll be fine.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "If you find yourself in a difficult place in your life, we urge you to reach out to friends, family, and mental health professionals. Please check out the resources over at /r/depression, /r/anxiety, and /r/suicidewatch. Feel free to [contact the /r/CSCareerQuestions mods](https://www.reddit.com/message/compose?to=%2Fr%2Fcscareerquestions&subject=&message=) for more information or help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "If you make those conclusions based on posts on Reddit, you have bigger problems than career prospects.\n\nTry to check philosophy of skepticism.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Surely once we have Einstein level AGI Agents, which will be duplicated Billions of times - won't these Billions of Agents create ASI pretty much the next day!?\n\n  \nWhat am I missing here?", "subreddit": "ArtificialInteligence", "is_post": 1}
{"post_body": "## Welcome to the r/ArtificialIntelligence gateway\n### Question Discussion Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Your question might already have been answered. Use the search feature if no one is engaging in your post.\n    * AI is going to take our jobs - its been asked a lot!\n* Discussion regarding positives and negatives about AI are allowed and encouraged. Just be respectful.\n* Please provide links to back up your arguments.\n* No stupid questions, unless its about AI being the beast who brings the end-times. It's not.\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "Yeah, that's the idea of the \"singularity\". That advancements on AI will go exponentially faster, and as the AI iterates on itself becoming smarter and smarter to a point where it just instantly becomes the most intelligent thing possible in the universe.\n\nIt's a cool idea, and also extremely scary.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "We won't see AGI at least not publicly accessible. If you develop AGI or ASI the smartest move would be to keep it hidden to out compete every company and state easily in every matter. If you Provide access to AGI or ASI you can task it to develop a privat or open source version of itself and make the original developer essentially useless. What we currently see is just a toy compared to AGI and ASI and we are probably very far away from seeing these.\n\n\nAGI just become closer simply by redefining the meaning of AGI as we did many years before with AI. In a few years some company will show a so called AGI model which has nothing to do with the original meaning of the word.", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "If it ever happens, that will happen in hours\n\nI don't think it'll happen that way though -- we'll get domain specific ASI very soon from advances in RL (maths, medicine, physics etc.)\n\nBut 'general' will take much much longer, same way FSD works great in some cities and some weather conditions -- but is still far off outside of those domains\n\nIt might be we don't actually need AGI, vertical ASI experts are the real revolution", "subreddit": "ArtificialInteligence", "is_post": 0}
{"post_body": "The title says it all but I've been having a hard time finding concrete data to show that the market is **significantly** worse than before the COVID bubble. I know its bad (my own experience thus far) but I would love to see actual numbers on the subject.", "subreddit": "cscareerquestions", "is_post": 1}
{"post_body": "you probably won't find any, even when I was still in school I noticed this sub is heavily leaning towards USA, and SF Bay Area/Seattle/NYC to be specific\n  \nso if you're not in, or targeting those 3 regions (I was) you can safely ignore probably 90%+ of the posts here\n  \nand if you're not even in, or targeting USA you can bump that number up to 99%\n  \n> Do we have concrete unemployment numbers for new CS graduates \n  \npssstt a little secret for you, \"unemployment\" means you've previously been employed, but is not anymore\n  \nso, you can't be \"unemployed\" if you've never been employed in the first place", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Let me you in on a secret… good candidates are still getting jobs…. Lots of people coming out of college are not even getting in the door because.\n\n1. They have no internships\n2. They have zero work related experience \n3. They have no problem solving skills.\n\nCS programs are a fry cry from where they were 20 years ago. The washout rate at my college was 80+% back then and the students coming in had better pre-existing skill sets. If you are the cream of the crop companies still want you. \n\nTo companies top college graduates are.\n\n1. Very smart but too dumb to realize when they are being taken advantage of. This means they can pay you less and get potentially more out of you.\n\n2. More innovative. You loose the ability to think outside the box as you age\n\n3. More willing to sacrifice to get ahead. Seniors have families and obligations outside of work, better networks and less willing to deal with bullshit. Out of college graduates are easier to manipulate isolate and take advantage of.", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Even in hot times this sub was filled with people complaining about not getting new grad roles. Basically all my buddies in college were business or engineering majors many of them in great hiring times also struggled to get that first job. This sub is a really bad echo chamber", "subreddit": "cscareerquestions", "is_post": 0}
{"post_body": "Graduates were sold a lie that after getting their degree they'd waltz into a 150k per year job with just a firm handshake. Hasn't been that way since at least 2010. \n\nGraduates REFUSE to start off small and work their way up. Tech support? Helpdesk? Never! I want my 150k a year META job. \n\nNow Graduates take out their anger and cope here.  \"it's AI!\" yadda yadda. \n\nDownvote me all you want. Its true. I graduated with a CS degree in 2019, couldnt pass a tech interview to save my life despite graduating with a B average from one of irelands best uni. Got a job in tech support, 2 years I was sys admin, 3 years and I was cyber security and currently make more money than all my friends who graduated and got a proper CS job right out the bat. \n\nLower your standards. AI isn't taking your job, we've seen the state of what chatgpt and copilot gives when asked. Either settle for a bit less, do some certs and personal projects, upskill or be left in the dust screaming and crying on reddit about the magic bogeyman who doesn't exist who took your job.", "subreddit": "cscareerquestions", "is_post": 0}
